In [2]:
import numpy as np
import pandas as pd

In [3]:
#Dictionary is a Two dimensional Data Frame

dict1 = {
    "name":["Shaheer", "Mimi", "Mirani", "Aisyah", "Mariyam", "Sarah"],
    "age":[30, 22, 20, 18, 19, 22],
    "city":["Karachi", "London", "Sumatra", "Jakatra", "Paris", "Washington DC"],
}

In [19]:
#Learning bout Two-Dimensional Data Frames
my_mimi = pd.DataFrame(dict1)

In [ ]:
my_mimi

In [ ]:
#Indexs: How to remove the index 
#If you are doing false: It means that you dont want anything
#If you are doing True: It means that you  want anything
my_excel = my_mimi.to_csv("My Beloved Mimi.csv", index = True)
print(my_excel)

In [ ]:
my_mimi.head(3) #This is how i can see the first lines of my data

In [ ]:
#This is how you can see the last lines of your data
my_mimi.tail(3)

In [ ]:
my_mimi.describe()

In [25]:
#Learning bout one-dimensional labeled array holding data type, If I remove np.nan from here the oitput will become int64
number_list = [1, 2, 3, 4, 5, 11, 12, 13, 14, 15]

In [ ]:
#DataFrame and Series
pd.Series(number_list)

In [ ]:
#Using date time index
dates = pd.date_range("20250301", periods=31)

In [ ]:
dates

In [ ]:
#This is how I can change the values of any particular key 
#Getting the dict name, its particular row and the index number
dict1["age"][3] = 21

In [6]:
pd.DataFrame(dict1)

      name  age           city
0  Shaheer   30        Karachi
1     Mimi   22         London
2   Mirani   20        Sumatra
3   Aisyah   21        Jakatra
4  Mariyam   19          Paris
5    Sarah   22  Washington DC

In [8]:
dict1["city"][1] = "Palembang"

In [9]:
pd.DataFrame(dict1)

      name  age           city
0  Shaheer   30        Karachi
1     Mimi   22      Palembang
2   Mirani   20        Sumatra
3   Aisyah   21        Jakatra
4  Mariyam   19          Paris
5    Sarah   22  Washington DC

In [10]:
dict1["age"][3] = 19

In [11]:
pd.DataFrame(dict1)

      name  age           city
0  Shaheer   30        Karachi
1     Mimi   22      Palembang
2   Mirani   20        Sumatra
3   Aisyah   19        Jakatra
4  Mariyam   19          Paris
5    Sarah   22  Washington DC

In [16]:
#How we can change the indexing/index number/row numbers
my_mimi.index = ["a", "b", "c", 'd', "e", "f"]

In [17]:
my_mimi

      name  age           city
a  Shaheer   30        Karachi
b     Mimi   22      Palembang
c   Mirani   20        Sumatra
d   Aisyah   19        Jakatra
e  Mariyam   19          Paris
f    Sarah   22  Washington DC

In [24]:
#You can check the datatype like this
type(my_mimi["age"])

pandas.core.series.Series